import random
playingCards=['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊A        ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊        A┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊2   ♥    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♥   2┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊3   ♥    ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊    ♥   3┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊4 ♥   ♥  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♥   ♥ 4┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊5 ♥   ♥  ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊  ♥   ♥ 5┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊6 ♥   ♥  ┊
┊         ┊
┊  ♥   ♥  ┊
┊         ┊
┊  ♥   ♥ 6┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊7 ♥   ♥  ┊
┊         ┊
┊  ♥ ♥ ♥  ┊
┊         ┊
┊  ♥   ♥ 7┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊8 ♥ ♥ ♥  ┊
┊         ┊
┊  ♥   ♥  ┊
┊         ┊
┊  ♥ ♥ ♥ 8┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊9 ♥ ♥ ♥  ┊
┊         ┊
┊  ♥ ♥ ♥  ┊
┊         ┊
┊  ♥ ♥ ♥ 9┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊10♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥10┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊J ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥ J┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊Q ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥ Q┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊K ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥ K┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊A        ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊        A┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊2   ♦    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♦   2┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊3   ♦    ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊    ♦   3┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊4 ♦   ♦  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♦   ♦ 4┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊5 ♦   ♦  ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊  ♦   ♦ 5┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊6 ♦   ♦  ┊
┊         ┊
┊  ♦   ♦  ┊
┊         ┊
┊  ♦   ♦ 6┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊7 ♦   ♦  ┊
┊         ┊
┊  ♦ ♦ ♦  ┊
┊         ┊
┊  ♦   ♦ 7┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊8 ♦ ♦ ♦  ┊
┊         ┊
┊  ♦   ♦  ┊
┊         ┊
┊  ♦ ♦ ♦ 8┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊9 ♦ ♦ ♦  ┊
┊         ┊
┊  ♦ ♦ ♦  ┊
┊         ┊
┊  ♦ ♦ ♦ 9┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊10♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦10┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊J ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦ J┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊Q ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦ Q┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊K ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦ K┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊A        ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊        A┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊2   ♣    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♣   2┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊3   ♣    ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊    ♣   3┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊4 ♣   ♣  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♣   ♣ 4┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊5 ♣   ♣  ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊  ♣   ♣ 5┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊6 ♣   ♣  ┊
┊         ┊
┊  ♣   ♣  ┊
┊         ┊
┊  ♣   ♣ 6┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊7 ♣   ♣  ┊
┊         ┊
┊  ♣ ♣ ♣  ┊
┊         ┊
┊  ♣   ♣ 7┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊8 ♣ ♣ ♣  ┊
┊         ┊
┊  ♣   ♣  ┊
┊         ┊
┊  ♣ ♣ ♣ 8┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊9 ♣ ♣ ♣  ┊
┊         ┊
┊  ♣ ♣ ♣  ┊
┊         ┊
┊  ♣ ♣ ♣ 9┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊10♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣10┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊J ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣ J┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊Q ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣ Q┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊K ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣ K┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊A        ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊        A┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊2   ♠    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♠   2┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊3   ♠    ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊    ♠   3┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊4 ♠   ♠  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♠   ♠ 4┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊5 ♠   ♠  ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊  ♠   ♠ 5┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊6 ♠   ♠  ┊
┊         ┊
┊  ♠   ♠  ┊
┊         ┊
┊  ♠   ♠ 6┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊7 ♠   ♠  ┊
┊         ┊
┊  ♠ ♠ ♠  ┊
┊         ┊
┊  ♠   ♠ 7┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊8 ♠ ♠ ♠  ┊
┊         ┊
┊  ♠   ♠  ┊
┊         ┊
┊  ♠ ♠ ♠ 8┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊9 ♠ ♠ ♠  ┊
┊         ┊
┊  ♠ ♠ ♠  ┊
┊         ┊
┊  ♠ ♠ ♠ 9┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊10♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠10┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊J ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠ J┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊Q ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠ Q┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊K ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠ K┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''']
PC=['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊A        ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊        A┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊2   ♥    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♥   2┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊3   ♥    ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊    ♥   3┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊4 ♥   ♥  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♥   ♥ 4┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊5 ♥   ♥  ┊
┊         ┊
┊    ♥    ┊
┊         ┊
┊  ♥   ♥ 5┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊6 ♥   ♥  ┊
┊         ┊
┊  ♥   ♥  ┊
┊         ┊
┊  ♥   ♥ 6┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊7 ♥   ♥  ┊
┊         ┊
┊  ♥ ♥ ♥  ┊
┊         ┊
┊  ♥   ♥ 7┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊8 ♥ ♥ ♥  ┊
┊         ┊
┊  ♥   ♥  ┊
┊         ┊
┊  ♥ ♥ ♥ 8┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊9 ♥ ♥ ♥  ┊
┊         ┊
┊  ♥ ♥ ♥  ┊
┊         ┊
┊  ♥ ♥ ♥ 9┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊10♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥10┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊J ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥ J┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊Q ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥   ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥ Q┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♥        ┊
┊K ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥  ┊
┊   ♥ ♥   ┊
┊  ♥ ♥ ♥ K┊
┊        ♥┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊A        ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊        A┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊2   ♦    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♦   2┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊3   ♦    ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊    ♦   3┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊4 ♦   ♦  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♦   ♦ 4┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊5 ♦   ♦  ┊
┊         ┊
┊    ♦    ┊
┊         ┊
┊  ♦   ♦ 5┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊6 ♦   ♦  ┊
┊         ┊
┊  ♦   ♦  ┊
┊         ┊
┊  ♦   ♦ 6┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊7 ♦   ♦  ┊
┊         ┊
┊  ♦ ♦ ♦  ┊
┊         ┊
┊  ♦   ♦ 7┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊8 ♦ ♦ ♦  ┊
┊         ┊
┊  ♦   ♦  ┊
┊         ┊
┊  ♦ ♦ ♦ 8┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊9 ♦ ♦ ♦  ┊
┊         ┊
┊  ♦ ♦ ♦  ┊
┊         ┊
┊  ♦ ♦ ♦ 9┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊10♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦10┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊J ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦ J┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊Q ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦   ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦ Q┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♦        ┊
┊K ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦  ┊
┊   ♦ ♦   ┊
┊  ♦ ♦ ♦ K┊
┊        ♦┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊A        ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊        A┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊2   ♣    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♣   2┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊3   ♣    ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊    ♣   3┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊4 ♣   ♣  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♣   ♣ 4┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊5 ♣   ♣  ┊
┊         ┊
┊    ♣    ┊
┊         ┊
┊  ♣   ♣ 5┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊6 ♣   ♣  ┊
┊         ┊
┊  ♣   ♣  ┊
┊         ┊
┊  ♣   ♣ 6┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊7 ♣   ♣  ┊
┊         ┊
┊  ♣ ♣ ♣  ┊
┊         ┊
┊  ♣   ♣ 7┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊8 ♣ ♣ ♣  ┊
┊         ┊
┊  ♣   ♣  ┊
┊         ┊
┊  ♣ ♣ ♣ 8┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊9 ♣ ♣ ♣  ┊
┊         ┊
┊  ♣ ♣ ♣  ┊
┊         ┊
┊  ♣ ♣ ♣ 9┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊10♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣10┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊J ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣ J┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊Q ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣   ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣ Q┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♣        ┊
┊K ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣  ┊
┊   ♣ ♣   ┊
┊  ♣ ♣ ♣ K┊
┊        ♣┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊A        ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊        A┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊2   ♠    ┊
┊         ┊
┊         ┊
┊         ┊
┊    ♠   2┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊3   ♠    ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊    ♠   3┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊4 ♠   ♠  ┊
┊         ┊
┊         ┊
┊         ┊
┊  ♠   ♠ 4┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊5 ♠   ♠  ┊
┊         ┊
┊    ♠    ┊
┊         ┊
┊  ♠   ♠ 5┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊6 ♠   ♠  ┊
┊         ┊
┊  ♠   ♠  ┊
┊         ┊
┊  ♠   ♠ 6┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊7 ♠   ♠  ┊
┊         ┊
┊  ♠ ♠ ♠  ┊
┊         ┊
┊  ♠   ♠ 7┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊8 ♠ ♠ ♠  ┊
┊         ┊
┊  ♠   ♠  ┊
┊         ┊
┊  ♠ ♠ ♠ 8┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊9 ♠ ♠ ♠  ┊
┊         ┊
┊  ♠ ♠ ♠  ┊
┊         ┊
┊  ♠ ♠ ♠ 9┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊10♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠10┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊J ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠ J┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊Q ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠   ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠ Q┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''','''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊♠        ┊
┊K ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠  ┊
┊   ♠ ♠   ┊
┊  ♠ ♠ ♠ K┊
┊        ♠┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''']
playingCardNames=['A♥','2♥','3♥','4♥','5♥','6♥','7♥','8♥','9♥','10♥','J♥','Q♥','K♥','A♦','2♦','3♦','4♦','5♦','6♦','7♦','8♦','9♦','10♦','J♦','Q♦','K♦','A♣','2♣','3♣','4♣','5♣','6♣','7♣','8♣','9♣','10♣','J♣','Q♣','K♣','A♠','2♠','3♠','4♠','5♠','6♠','7♠','8♠','9♠','10♠','J♠','Q♠','K♠']
board=[[],[],[],[],[],[],[]]
boardDisplay=[
    ['','','','','','','','',''],#0
    
    ['','','','','','','','',''],#1
    ['','','','','','','','',''],#2
    ['','','','','','','','',''],#3
    ['','','','','','','','',''],#4
    ['','','','','','','','',''],#5
    ['','','','','','','','',''],#6
    ['','','','','','','','',''],#7
    
    ['','','','','','','','',''],#8
    ['','','','','','','','',''],#9
    ['','','','','','','','',''],#10
    ['','','','','','','','',''],#11
    ['','','','','','','','',''],#12
    
    ['','','','','','','','',''],#13
    ['','','','','','','','',''],#14
    ['','','','','','','','',''],#15
    ['','','','','','','','',''],#16
    ['','','','','','','','',''],#17
    ['','','','','','','','',''],#18
    ['','','','','','','','','']#19
    ]
foundation=[
    ['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯'''],
    ['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯'''],
    ['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯'''],
    ['''╭ꟷꟷꟷꟷꟷꟷꟷ╮
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
╰ꟷꟷꟷꟷꟷꟷꟷ╯''']]
stock=[]
stockDisplay=0
random.shuffle(playingCards)
def displayBoard():
    for i in range(len(boardDisplay)):
        for e in range(len(boardDisplay[i])):
            boardDisplay[i][e]=''
    a=0
    for i in range(len(board)):
        for e in range(len(board[i])):
            for g in range(len(board[i][e].splitlines())):
                temp = board[i][e].splitlines()
                if(a<=6):
                    boardDisplay[1][g]+=temp[g]
                elif(a<=12):
                    boardDisplay[2][g]+=temp[g]
                elif(a<=17):
                    boardDisplay[3][g]+=temp[g]
                elif(a<=21):
                    boardDisplay[4][g]+=temp[g]
                elif(a<=24):
                    boardDisplay[5][g]+=temp[g]
                elif(a<=26):
                    boardDisplay[6][g]+=temp[g]
                elif(a<=27):
                    boardDisplay[7][g]+=temp[g]
            a+=1
    for i in range(3):
        for e in range(len(stock[i+stockDisplay].splitlines())):
            temp=stock[i+stockDisplay].splitlines()
            boardDisplay[0][e]+=temp[e]
    for i in range(4):
        for e in range(len(foundation[i][len(foundation[i])-1].splitlines())):
            temp=foundation[i][len(foundation[i])-1].splitlines()
            boardDisplay[0][e]+=temp[e]
    b=0
    for i in range(7):
        for e in range(b):
            for g in range(9):
                if(g!=8):
                    boardDisplay[i+1][g]+='┊         ┊'
                else:
                    boardDisplay[i+1][g]+='┊_________┊'
        b+=1
    for i in range(7,12):
        for e in range(7):
            for g in range(9):
                if(g!=8):
                    boardDisplay[i+1][g]+='┊         ┊'
                else:
                    boardDisplay[i+1][g]+='┊_________┊'
    for i in range(12,19):
        for e in range(b):
            for g in range(9):
                if(g!=8):
                    boardDisplay[i+1][g]+='┊         ┊'
                else:
                    boardDisplay[i+1][g]+='┊_________┊'
        b-=1
    for i in boardDisplay:
        print('\n'.join(i))
def newGame():
    global stock
    if(len(playingCards)==0):
        for i in PC:
            playingCards.append(i)
        stock=[]
    a = 51
    for i in range(len(board)):
        for e in range(i+1):
            board[i].append(playingCards.pop(a))
            a-=1
    for i in range(len(playingCards)):
        stock.append(playingCards.pop(a))
        a-=1
    board.reverse()
    displayBoard()
def move(fromCol,fromRows,toCol):
    temp=[]
    for i in range(len(board)):
        if(i>=fromRows):
            temp.append(board[i][fromCol])
            board[i][fromCol]='''┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊         ┊
┊_________┊'''
def draw():
    global stockDisplay
    if(stockDisplay==len(stock)-3):
        stockDisplay=0
    else:
        stockDisplay+=1
    displayBoard()
